Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འགྲོ་བ་ཐམས་ཅད་དང་མངོན་སུམ་དུ་གནས་པའི་ཐམས་ཅད་མཁྱེན་པའི་སྒོ་དང་། ལམ་གྱི་ཚུལ་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་སེམས་ཀྱི་གྲོང་ཁྱེར་དམིགས་པར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to the perception of the city of the mind through teaching the way of the path and gateways to omniscience that are directly perceivable by all beings.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་རང་གི་སྨོན་ལམ་དུ་མངོན་པར་བསྒྲུབ་པ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་སེམས་ཀྱི་གྲོང་ཁྱེར་བྱིན་གྱི་བརླབ་པའི་ཚུལ་ལ་མཁས་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to being skilled in the ways of blessing the city of the mind through the pure accomplishment of the ocean of prayers of all the tathāgatas in the three times within your own prayer.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་རྣམ་པར་སྤེལ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་ཚོགས་ཀྱི་མཐུ་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཐབས་ལ་མཁས་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to increasing the power of the accumulations of the city of the mind through increasing the great, vast accumulations of merit and wisdom in the entire realm of the Dharma.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་དང་། དབང་པོ་དང་མོས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བར་ཤེས་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་ནས་འོད་ཀུན་ཏུ་དགྱེ་བའི་ཐབས་ལ་མཁས་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to being skilled in the method for emitting light from the city of the mind through knowing the minds, thoughts, faculties, aspirations, defilements, and purification of all beings.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐམས་ཅད་ཡང་དག་པར་བསྡུ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་དུ་དབང་བསྒྱུར་བའི་ཚུལ་ལ་མཁས་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to being skilled in the way of gaining power over the city of the mind through gathering all the ways of the realm of the Dharma.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དྲན་ཞིང་སྣང་བར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་འོད་གསལ་བར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to illuminating the city of the mind through remembering and illuminating all the tathāgatas.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ལུས་མེད་པའི་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་རང་བཞིན་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: “Noble one, you should be dedicated to knowing the nature of the city of the mind through realizing all the ways of the bodyless Dharma.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པའི་ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་འགྲོ་བར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་སྒྱུ་མ་ལྟ་བུར་བརྟག་པ་ལ་བརྩོན་པར་གྱིས་ཤིག་དང་།
en: “Noble one, you should be dedicated to examining as an illusion the city of the mind through going to the city of the Dharma of omniscience.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་སྦྱང་བ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པ་ཐོབ་པར་ནུས་སོ། །
en: “Noble one, in that way the bodhisattva who is dedicated to the purification of the city of the mind will be able to attain the accomplishment of all roots of merit.

source: དེ་ལྟར་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་མདུན་ནི་སངས་རྒྱས་མཐོང་བར་བྱ་བ་ལ་སྒྲིབ་པའམ། ཆོས་མཉན་པར་བྱ་བ་ལ་སྒྲིབ་པའམ། དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ལ་སྒྲིབ་པའམ། སེམས་ཅན་ཡོངས་སུ་བསྡུ་བའི་སྦྱོར་བ་ལ་སྒྲིབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་སྒྲིབ་པ་ཡང་རུང་སྟེ།
en: Because bodhisattvas who thus purify the city of the mind have before them no obscurations: there are no obscurations to seeing the buddhas, no obscurations to hearing the Dharma, no obscurations to venerating and making offerings to the tathāgatas, no obscurations to engaging in gathering beings, and no obscurations to purifying buddha realms.

source: སྒྲིབ་པ་ཐམས་ཅད་མི་གནས་སོ། །རིགས་ཀྱི་བུ་སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བའི་སེམས་དང་། ལྷག་པའི་བསམ་པས་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ལས་གྲོན་ཆུ་དུས་དགེ་བའི་བཤེས་གཉེན་མཐོང་བར་འགྱུར་ཏེ།
en: “Noble one, bodhisattvas who are dedicated to seeing kalyāṇamitras with a mind free of all obscurations and with a higher motivation will with little difficulty see a kalyāṇamitra.

source: རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །
en: “Noble one, the omniscience of bodhisattvas depends on the kalyāṇamitras.”

source: དེ་ནས་ལུས་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་མོ་ཆོས་ཀྱི་པད་མོ་དཔལ་གྱི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་དང་ངོ་ཚ་ཤེས་པའི་དཔལ་གྱི་དོག་པའི་འོད་ཅེས་བྱ་བ་གཉིས་ཤིག་ལྷ་མོའི་ཚོགས་ཚད་མེད་པས་ཡོངས་སུ་བསྐོར་ནས། ལྷ་མོ་སྒྱུ་མའི་ལེགས་པ་བརྗོད་ཅིང་སྙིང་པོ་བྱང་ཆུབ་ནས་འཐོན་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མདུན་གྱི་ནམ་མཁའ་ལ་འཁོད་ནས། རང་རང་གི་རིན་པོ་ཆེའི་རྣ་ཆ་ལས་འོད་གཟེར་གྱི་དྲ་བ་རིན་པོ་ཆེའི་ཁ་དོག་དུ་འདུག་པ་དུ་མ་དང་། སྤོས་དང་། འདུག་པ་དྲི་མ་མེད་པ། འོད་འཕྲོ་བའི་ཁ་དོག་དུ་འདུག་པ་དུ་མ་དང་།
en: Then two of the family of goddesses of the body, who were named Dharma­padma­śrī­kuśalā and Hrī­śrī­mañjari­prabhāvā, encircled by an innumerable assembly of goddesses, emerged from the bodhimaṇḍa, uttering praises of Māyādevī.

source: སེམས་དང་བསམ་པ་མོས་པ་བྱེད་པའི་ཁ་དོག་དང་། སེམས་ཀྱི་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱེད་པའི་ཁ་དོག་དང་། ལུས་ཀྱི་གདུང་བ་སིམ་པར་བྱེད་པའི་ཁ་དོག་དང་། ལུས་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། ལུས་ཀྱི་མཐུ་ཐོག་པ་མེད་པར་འབྱུང་བའི་ཡུལ་དང་ལྡན་པའི་འོད་གཟེར་གྱི་དྲ་བ་མང་པོ་བཀྱེ་བས།
en: They arranged themselves in the sky before Sudhana, the head merchant’s son, and emitted from their precious earrings a net of many light rays the colors of jewels; many pure perfumes and incenses the colors of shining lights; colors attractive to mind and thought; colors that increased the power of joy in the mind; colors that eased the pains of the body; colors that revealed pure bodies; and nets of light rays that were a field of perception that gave rise to an unimpeded prowess of the body and illuminated vast realms.

source: ཞིང་རྒྱ་ཆེ་ན་པོ་སྣང་བར་བྱས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་ཐམས་ཅད་དུ་ཁྱབ་པ།
en: They revealed to Sudhana, the head merchant’s son, all the bodies of all tathāgatas, which are present everywhere and facing everywhere.

source: ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པ་ཡོངས་སུ་བསྟན་ནས་འཇིག་རྟེན་ཐམས་ཅད་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོའི་གཙུག་ཏུ་ཤར་ནས།
en: Then they completely circled, to their right, the entire world, and then shone upon the crown of the head of Sudhana, the head merchant’s son.

source: སྤྱི་བོའི་གཙུག་མན་ཆད་བ་སྤུའི་བུ་ག་ཐམས་ཅད་དུ་ཞུགས་ཏེ་ལུས་ཀུན་ཏུ་ཁྱབ་པར་གྱུར་ཏོ། །
en: They completely pervaded him, from the crown of his head to the pores of his body.

source: དེ་ལྟར་ལྷ་མོ་དེ་དག་གི་འོད་གཟེར་གྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཕོག་མ་ཐག་ཏུ་དེའི་མོད་ལ་མུན་པ་ཐམས་ཅད་དང་། མི་གནས་པའི་མིག་རྡུལ་དང་བྲལ་བའི་འོད་སྣང་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: As soon as the light rays from those goddesses touched Sudhana, the head merchant’s son, in that instant he attained the eyesight called the dust-free illuminations, which was free from all blinding darkness.

source: སེམས་ཅན་གྱི་རང་བཞིན་ཁོང་དུ་ཆུད་པར་བྱེད་པའི་མིག་རབ་རིབ་དང་བྲལ་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called free from the obscuration of sight, through which he perceived the nature of beings.

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱི་དཀྱིལ་འཁོར་ལ་རྣམ་པར་ལྟ་བའི་མྱིག་རྡུལ་དང་བྲལ་བས་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called the lord of freedom from dust, through which he looked at the field of the nature of all phenomena.

source: ཞིང་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའི་མྱིག་རྣམ་པར་དག་པ་ལ་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called lord of purity, through which he looked at the character of all realms.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྐུ་ལ་རྣམ་པར་ལྟ་བའི་མིག་རྣམ་པར་སྣང་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called shining light, through which he looked upon the Dharma bodies of all tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་རྣམ་པར་ཕྱེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་རྣམ་པར་ལྟ་བའི་མིག་རྣམ་པར་དག་པའི་བློ་གྲོས་ཤེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called pure intelligence, through which he looked upon the countless categories of the created form bodies of the tathāgatas.

source: ཞིང་རྒྱ་མཚོ་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྱུང་བ་དང་། འཇིག་པ་རྣམ་པར་ཕྱེ་བ་ལ་རྣམ་པར་ལྟ་བའི་མིག་ཆགས་པ་མེད་པའི་འོད་ཅེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called unimpeded light, through which he looked upon the categories of the origination and destruction of world realms throughout the vast extent of the ocean of realms.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་མདོ་སྡེའི་ཚུལ་མངོན་པར་བསྒྲུབ་པའི་ཕྱོགས་ལ་རྣམ་པར་ལྟ་བའི་མིག་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called complete light, through which he looked upon the aspect of the creation of the way of the sūtras in the Dharma wheel of all the tathāgatas.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། སེམས་ཅན་འདུལ་བའི་བྱིན་གྱི་རླབས་ལ་རྣམ་པར་ལྟ་བའི་མྱིག་ཀུན་ནས་ཡུལ་དུ་འགྱུར་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called the complete field of perception, through which he looked upon the miracles of the buddhas and their blessings that guide beings.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བྱུང་བའི་སངས་རྒྱས་སྐྱེས་པ་ལ་རྣམ་པར་ལྟ་བའི་མིག་ཀུན་ཏུ་ལྟ་བ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the eyesight called complete sight, through which he looked upon the births of buddhas that occurred in all buddha realms.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འགྲོ་བའི་ཁང་པའི་སྒོ་སྲུང་སྲིན་པོའི་དབང་པོ་སྲིན་པོ་སྟོང་ཕྲག་བཅུའི་གཙོ་བོ་མྱིག་བཟངས་ཤེས་བྱ་བ་ཆུང་མར་བཅས་བུ་དང་བཅས། རང་གི་གཉེན་བཤེས་དང་འཁོར་དུ་བཅས་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་ཡིད་དུ་འོང་བས་མངོན་པར་གཏོར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་ཉེ་བར་བསྙེན་པ་ཡིན་ཏེ།
en: Then the guardian at the door of the meeting hall of the bodhisattvas, the leader of ten thousand rākṣasas, whose name was Sunetra, with his wives, children, relatives, and entourage, threw flowers of many beautiful colors over Sudhana, the head merchant’s son, and said to him, “Noble one, a bodhisattva who has ten qualities will be near to all kalyāṇamitras.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟར་བསམ་པ་ཡོངས་སུ་དག་པ། གཡོ་དང་སྒྱུ་མེད་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པ་ལ་ཐ་མི་དད་པའི་སྙིང་རྗེ་ཆེན་པོ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཅན་མེད་པའི་རང་བཞིན་ངེས་པར་རྟོགས་པའི་རབ་ཏུ་རྟོགས་པ་དང་།
en: What are these ten?

source: ལྷག་པའི་བསམ་པའི་སྟོབས་ཐམས་ཅད་མཁྱེན་པར་འགྲོ་བ་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་དཀྱིལ་འཁོར་ལ་མངོན་པར་འདུན་པའི་མོས་པའི་སྟོབས་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དྲི་མ་མེད་པས་རྣམ་པར་དག་པའི་མིག་དང་། སེམས་ཅན་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་ཐ་མི་དད་པའི་བྱམས་པ་ཆེན་པོ་དང་། བསྒྲིབས་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་དང་འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱི་གཉེན་པོ་གདུགས་སུ་གྱུར་པའི་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་དང་།
en: They are (1) a pure motivation without deception or guile, (2) a compassion that gathers all beings without discrimination, (3) the insight that realizes that the nature of all beings is that there are no beings, (4) a superior motivation for proceeding irreversibly toward omniscience, (5) the strength of the aspiration that is directed toward the field of the tathāgatas, (6) the vision of the purity of the stainlessness of the nature of all phenomena, (7) the great love without discrimination for the field of beings, (8) the light of wisdom, which dispels all obscurations, (9) the great cloud of the Dharma, which is a parasol that counters all the suffering of saṃsāra, and (10) the eyes of wisdom that are focused on following the kalyāṇamitras and enter into all the streams within the realm of the Dharma.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་རྒྱུད་ཐམས་ཅད་ལ་རབ་ཏུ་ཞུགས་ཤིང་། དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བ་མངོན་དུ་གྱུར་པའི་ཡེ་ཤེས་ཀྱི་མིག་སྟེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་ཉེ་བར་བསྙེན་པ་ཡིན་ནོ། །
en: “Noble one, the bodhisattva who has these ten qualities will be near to all kalyāṇamitras.

source: ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་བཅུས་རྣམ་པར་ལྟ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་མངོན་ཏུ་གྱུར་པ་ཐོབ་པ་ཡིན་ཏེ།
en: “The bodhisattva who sees the ten entryways to resting in samādhi will attain the direct perception of all kalyāṇamitras.

source: ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟར་རྡུལ་དང་བྲལ་བར་རྣམ་པར་དཔྱོད་པའི་དཀྱིལ་འཁོར་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་དུ་གྱུར་པའི་མྱིག་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་དམྱིགས་པ་ཐམས་ཅད་ལ་རྣམ་པར་མི་རྟོག་རྣམ་པར་མི་དཔྱོད་པ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་ཕྱོགས་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པའི་སྤྲིན་ཡོངས་སུ་འབྱུང་བ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། བསོད་ནམས་རྒྱ་མཚོ་སྩོགས་པའི་སྙིང་པོ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་སེམས་བསྐྱེད་པ་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་འབྱུང་བ་དང་། འབྲལ་བ་མེད་ཅིང་ཉེ་བར་གྱུར་པ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁར་ལས་པས་ཡོངས་སུ་གྲུབ་པ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་ཡོངས་སུ་མི་འབྲལ་བ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་རྟག་པར་ཀུན་ཏུ་ཉེ་བར་འགྲོ་བའི་སྦྱོར་བ་དང་། ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་དགེ་བའི་བཤེས་གཉེན་གྱི་ཐབས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་ཀྱིས་དུབ་པ་མེད་པའི་སྦྱོར་བ་སྟེ།
en: They are (1) the entryway to resting in the samādhi of the field of analyzing all phenomena as being like dust-free space, (2) the entryway to resting in the samādhi of the vision that directly perceives the ocean of all directions, (3) the entryway to resting in the samādhi of the nonexamination and nonanalysis of all perception, (4) the entryway to resting in the samādhi of the arising of the clouds of tathāgatas in all directions, (5) the entryway to resting in the samādhi of the essence of the accumulation of an ocean of omniscient wisdom and merit, (6) the entryway to resting in the samādhi of the development of all aspirations to be inseparably near to the occurrence of kalyāṇamitras, (7) the entryway to resting in the samādhi of all the qualities of the tathāgatas originating from the mouths of the kalyāṇamitras, (8) the entryway to resting in the samādhi of inseparability from all the tathāgatas, (9) the entryway to resting in the samādhi of being engaged in being near, always and equally, to all kalyāṇamitras, and (10) the entryway to resting in the samādhi of engaging without weariness in all the conduct of methods of the kalyāṇamitras.

source: རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་ལ་ངེས་པར་གཞག་པའི་སྒོ་བཅུ་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་། མངོན་ཏུ་གྱུར་པ་ཐོབ་པ་ཡིན་ཏེ།
en: “Noble one, the bodhisattva who has those ten qualities will attain the direct perception of all kalyāṇamitras.

source: ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁ་ནས་གྲགས་པ་ཞེས་བྱ་བ་ཡང་ཐོབ་པས་དེ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཐམས་ཅད་ཐ་མི་དད་ཅིང་མཉམ་པ་ཉིད་དུ་འགྱུར་བ་ཡང་རབ་ཏུ་འཐོབ་བོ། །
en: The bodhisattva who attains the liberation of the samādhi called the Dharma wheels of all the tathāgatas proclaimed from the mouth of the kalyāṇamitra will, by entering it, attain the undifferentiated equality of all buddhas and the undifferentiated omnipresence of the kalyāṇamitras.”

source: དགེ་བའི་བཤེས་གཉེན་ཐ་མི་དད་ཅིང་ཐམས་ཅད་དུ་ཁྱབ་པའང་རབ་ཏུ་ཐོབ་པར་འགྱུར་ཏོ། །སྲིན་པོའི་དབང་པོ་མིག་བཟངས་ཀྱིས་དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: That is what Sunetra, the lord of the rākṣasas, said.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ནམ་མཁའི་དབྱིངས་ལ་བལྟས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་ལ་ཐུགས་བརྩེ་བར་མཛད་དེ། དགེ་བའི་བཤེས་གཉེན་བསྟེན་པས་སྨན་ཡོན་བཏགས་པ་མ་ནོངས་སོ། །
en: Then Sudhana, the head merchant’s son, stared into the sky and said, “Ārya, you have regarded me with compassion and without error taught the kalyāṇamitras in order to benefit me.

source: ད་དུང་ཡང་དགེ་བའི་བཤེས་གཉེན་བལྟ་བའི་སླད་དུ། ཇི་ལྟར་བརྩོན་པར་བགྱི་བ་དང་། ཕྱོགས་གང་ལོགས་སུ་མཆི་བར་བགྱི་བ་དང་། གནས་གང་ཞིག་དུ་ཡོངས་སུ་བཙལ་བ་དང་། དམིགས་པ་གང་ཞིག་བསམ་པར་བགྱི་བའི་ཐབས་ཀྱི་སྒོ་མ་ནོར་བར་བསྟན་དུ་གསོལ། སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་བས་ན་ཕྱོགས་ཀུན་ཏུ་རབ་ཏུ་འདུད་པའི་ལུས་དང་། དམིགས་པ་ཐམས་ཅད་དུ་དགེ་བའི་བཤེས་གཉེན་དྲན་པ་དང་།
en: In addition, I pray that you teach me without error the entrance ways to methods concerning how to apply myself to seeing the kalyāṇamitras, in what direction I should go, in what places I should search, and upon what goal I should focus my thoughts.”

source: འབྲེལ་པའི་བསམ་པ་དང་། ཀུན་ཏུ་འགྲོ་བའི་ཏིང་ངེ་འཛིན་གྱི་རྗེས་སུ་འབྲང་བ་དང་། སེམས་ཀྱི་ཤུགས་རྨི་ལམ་ལྟ་བུ་དང་། ཡིད་ཀྱི་ལུས་གཟུགས་བརྙན་ལྟ་བུས་རྣམ་པར་རྒྱུ་སྟེ། འགྲོ་བས་དགེ་བའི་བཤེས་གཉེན་གྱི་གན་དུ་སོང་ཤིག །
en: Sunetra, the lord of the rākṣasas, replied, “Noble one, you should go to the kalyāṇamitras by going with a body that bows down in every direction, with thoughts that are fastened on remembering the kalyāṇamitras as their object, following the samādhi that goes everywhere, with strength of mind that is like a dream, and traveling with a body of the mind that is like a reflection.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་སྲིན་པོའི་དབང་པོ་མིག་བཟངས་ཀྱིས་ཇི་སྐད་དུ་གཏམས་པ་དེ་ལྟར་ནན་ཏན་དུ་བྱས་པ་དང་། མདུན་གྱི་སའི་ནང་ནས་པད་མོ་ཆེན་པོ་རྡོ་རྗེ་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་གྲུབ་པའི་ཆུ་བ་ཅན། ནང་རིམ་རིན་པོ་ཆེའི་རྒྱལ་པོ་འགྲོ་བ་རྒྱ་མཚོ་སྣ་ཚོགས་ལས་བྱས་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ལས་འདབ་མའི་ཕྲེང་བ་གྲུབ་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ཅན་སྤོས་ཀྱི་རིན་པོ་ཆེའི་རྒྱལ་པོ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མདོག་གི་ཟེ་བ་དང་ལྡན་པ།
en: Then Sudhana, the head merchant’s son, practicing as he had been told by Sunetra, the lord of the rākṣasas, saw rising from the ground before him a great lotus with a stem made entirely from diamond jewels, with sepals made from a variety of kings of jewels of the world’s oceans, with a circle of petals formed from all kings of jewels, with a pericarp made of shining kings of jewels, with filaments the colors and aromas of all the precious kings of jewels, and covered by a net of countless jewels.

source: རིན་པོ་ཆེའི་དྲ་བ་གྲངས་མེད་པས་ཀུན་ནས་ཡོག་པ་བྱུང་བ་མཐོང་ངོ་། །རིན་པོ་ཆེའི་རྒྱལ་པོའི་པད་མོ་ཆེན་པོ་དེའི་སྙིང་པོ་ལའང་། ཁང་པ་བརྩེགས་པ་ཆོས་ཀྱི་ཕྱོགས་སུ་ཡང་དག་པར་གཞོལ་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ཤིན་ཏུ་སྤ་ལ་བལྟ་ན་སྡུག་པ་སའི་གཞི་རྣམ་པར་སྣང་བའི་དབྱིབས་དང་ལྡན་པ།
en: He saw on the pericarp of that great lotus made of the kings of jewels a kūṭāgāra called Dharma­dhātu­diksamavasaraṇa­garbha, which was well adorned and beautiful, with a base that was the shape of a shining vajra.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ལས་བྱས་པའི་ཀ་བ་སྟོང་ཚང་བས་མཛེས་པར་བརྒྱན་པ།
en: A full thousand pillars made from the kings of jewels beautifully adorned it.

source: རྒྱན་ཐམས་ཅད་དུ་རིན་པོ་ཆེ་ཐམས་ཅད་བཀྲམ་པ།
en: Every kind of jewel was displayed as every kind of adornment.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་དྲི་མ་མེད་པའི་ལྷ་རྫས་ཀྱི་གཞི་བཏིང་བ།
en: Its floor was made of divine Jambu River gold.

source: མུ་ཏིག་གི་ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་དྲ་བ་གྲངས་མེད་པ་ཀུན་ནས་བྲེས་པ།
en: Countless nets of various strings of pearls were spread upon it.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་རབ་ཏུ་སྤ་བར་སྤེལ་བས་བརྒྱན་པ།
en: It was adorned by a beautifying blend of various kings of jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་ནོར་བུ་རིན་པོ་ཆེས་ཀུན་ནས་རྣམ་པར་ཕྱེ་བ།
en: It had a complete array of the precious jewels of Jambudhvaja.

source: རིན་པོ་ཆེའི་ཁྲི་འཕང་གྲངས་མེད་པས་ཀུན་ནས་བསྐོར་བ།
en: It was encircled by countless precious balconies.

source: ཕྱོགས་ཐམས་ཅད་ནས་རིན་པོ་ཆེའི་རྒྱལ་པོའི་ཐེམ་སྐས་མཛེས་པར་བཀྱེ་བ་གནས་པར་མཐོང་ངོ་། །
en: On all sides, stairways made of kings of jewels were beautifully arranged.

source: ཁང་པ་བརྩེགས་པ་དེའི་དབུས་ན་ཡང་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་པད་མོའི་སྙིང་པོ་ཅན།
en: He saw in the center of the kūṭāgāra a throne of wish-fulfilling jewels with a lotus on its center.

source: ནོར་བུ་རིན་པོ་ཆེའི་གཟུགས་འཇིག་རྟེན་གྱི་དབང་པོའི་དབྱིབས་ལྟ་བུའི་རྟེན་གྱིས་བཟུང་བ།
en: It was composed of precious jewels, and its base had the representations of all the lords of the world.

source: ནོར་བུ་རིན་པོ་ཆེའི་འབྲུ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དུ་འདུག་པ།
en: It had the colors of all gems of precious jewels.

source: དབང་པོའི་རྒྱལ་མཚན་རབ་ཏུ་སྣང་བའི་དབྱིབས་སུ་འདུག་པ།
en: It had the shape of Indra’s radiant banner.

source: རྡོ་རྗེ་རིན་པོ་ཆེའི་འཁོར་ལོའི་ས་ལ་རྟེན་པ།
en: It was set upon the surface of a ground that was a circle of precious diamonds.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་བརྒྱན་པ།
en: It had an array of rows of various kings of jewels.

source: རིན་པོ་ཆེའི་ཁྲི་འཕང་དུ་མ་ལས་བླངས་པ།
en: It was encircled by many precious platforms.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་རྒྱལ་མཚན་གྱིས་རབ་ཏུ་སྤྲས་པ།
en: It was decorated by shining banners of kings of jewels.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པ།
en: It was beautified by an array of various jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོའི་སྟན་ལྷ་རྫས་ལས་འདས་པ་ལེགས་པར་བཏིང་བ།
en: Upon it was placed a cushion that was superior to divine material.

source: གོས་རིན་པོ་ཆེ་ཁ་དོག་མཐའ་ཡས་པ་སྣ་ཚོགས་ཀྱི་གཞི་ཐམས་ཅད་དུ་བཀྲམ་པ།
en: Its surface was covered with precious cloths of various infinite colors.

source: རིན་པོ་ཆེའི་གོས་ཐམས་ཅད་ཀྱི་གནམ་ཡོལ་བྲེས་པས། ནམ་མཁའ་རབ་ཏུ་བརྒྱན་པ།
en: Decorative canopies of all kinds of precious cloth adorned the sky.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བ་ཀུན་ཏུ་བྲེས་པ།
en: It was draped in nets of all jewels.

source: ཕྱོགས་ཀུན་ནས་རིན་པོ་ཆེའི་རྒྱལ་མཚན་དགྲིགས་པའི་སྒྲ་འབྱུང་བ།
en: In all directions there was the sound of the flapping of arrayed precious banners.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྣམ་བུའི་རྒྱལ་མཚན་ཕུར་ལབ་དུ་ལྡིང་བ།
en: Banners of cloth made of all jewels fluttered.

source: སྤོས་ཀྱི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་རྣམ་པར་བྲེས་པས་ཀུན་ནས་བརྒྱན་པ།
en: It was adorned by an arrangement of banners of all precious aromatic jewels.

source: མེ་ཏོག་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་ལས་མེ་ཏོག་གི་གློང་སྣ་ཚོགས་ཆར་དུ་མངོན་པར་འབྲུལ་པ།
en: Banners made of all flowers emitted a rain of showers of various flowers.

source: རིན་པོ་ཆེའི་དྲིལ་བུའི་རྒྱལ་མཚན་འཁྲོལ་བའི་སྒྲ་ཡིད་བདེ་བའི་དབྱངས་སྙན་པར་གྲག་པ།
en: Banners of precious bells emitted melodious, beautiful sounds.

source: ཁང་པའི་ཁ་ཐམས་ཅད་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་རབ་ཏུ་སྦྱངས་པ།
en: All the entrances of the building were decorated with strings of various jewels.

source: རིན་པོ་ཆེའི་གཟུགས་སྣ་ཚོགས་ཀྱི་ཁ་ནས་སྤོས་ཆུ་ཁ་དོག་དུ་མ་དང་ལྡན་པའི་ཆར་འབབ་པ།
en: From various precious jewels in the form of spouts issued a rain of scented water in many different colors.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་ལས་གླང་པོ་དམ་པའི་གཟུགས་སུ་བྱས་པའི་ཁ་ནས་པད་མོའི་དྲ་བ་འབྱུང་བ་དང་ལྡན་པ།
en: From the mouths of elephant lords formed from shining kings of precious jewels came networks of lotuses.

source: རྡོ་རྗེ་སྣ་ཚོགས་ཀྱི་སེང་གེའི་ཁ་ནས་སྤོས་ཀྱི་སྤྲིན་ཁ་དོག་མཐའ་ཡས་པ་རབ་ཏུ་འབྱུང་བ།
en: From the mouths of lions made of a variety of diamonds came clouds of incense in endless colors.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ། ཚངས་པའི་གཟུགས་སུ་འདུག་པའི་ཁ་ནས་བྱམས་པ་ཆེན་པོའི་ཚུལ་ཚངས་པའི་དབྱངས་ཀྱི་ང་རོ་སྒྲོག་པ་དང་ལྡན་པ།
en: From the mouths of statues of Brahmā made from shining kings of jewels there resounded in a loving manner the sound of the voice of Brahmā.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཤིན་ཏུ་མཛེས་པའི་གཟུགས་ཀྱི་ཁ་ནས་དཀར་པོའི་ཕྱོགས་ཀྱི་ལེགས་པ་རབ་ཏུ་བརྗོད་པའི་ང་རོ་འབྱུང་བ་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་མཚན་གསེར་གྱི་དྲིལ་གྱི་ཕྲེང་བ་ལས་སྒྲ་སྙན་པའི་དབྱངས་སུ་འབྱུང་བ་དང་ལྡན་པ།
en: From the mouths of beautiful statues made of various jewels resounded the beautiful sounds of praises of goodness. From strings of golden bells were emitted the pleasant sounds of the names of the buddhas in the three times.

source: ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་དྲིལ་གྱི་ཕྲེང་བ་ལས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ཡིད་དུ་འོང་བ་འབྱུང་བ།
en: From strings of bells made of excellent precious jewels came the beautiful sounds of the Dharma wheels of all the buddhas.
